Repository: StudentAssistantHSE/edu-app-core
Catalog: edu_localizations/lib/src/app_*.arb
Languages: ru

# login_login_emailOrUsernameInputHint
source: E-mail / username
ru: E-mail / имя пользователя

# login_login_passwordInputHint
source: Password
ru: Пароль

# login_login_submitLoginButtonText
source: Sign in
ru: Войти

# login_login_pageTitle
source: Signing in
ru: Вход

# login_login_registrationButtonText
source: Sign up
ru: Зарегистрироваться

# login_login_passwordRecoveryButtonText
source: Forgot password?
ru: Забыли пароль?

# login_login_incorrectCredentialsMessage
source: Incorrect credentials
ru: Неверные учетные данные

# login_login_accountDisabledMessage
source: Your account was disabled. Please contact out support team
ru: Ваш аккаунт был отключен. Пожалуйста, свяжитесь с нашей командой поддержки

# login_login_noPrivilegesMessage
source: You don't have the necessary permissions
ru: У вас отсутствуют требуемые права

# login_login_connectionErrorMessage
source: Connection error
ru: Ошибка подключения

# login_login_undefinedErrorMessage
source: Something went wrong
ru: Что-то пошло не так

# login_emailCode_pageTitle
source: Signing in
ru: Вход

# login_emailCode_pageSubtitle
source: Enter the code that we have sent to your e-mail
ru: Введите код, который мы отправили вам на e-mail

# login_emailCode_attemptsLeftMessage
source: {current,plural, =1{1 attempt left} few{{current}/{max} attempts left} many{{current}/{max} attempts left} other{{current}/{max} attempts left}}
ru: {current,plural, =1{Осталась 1 попытка} few{Осталось {current}/{max} попытки} many{Осталось {current}/{max} попыток} other{Осталось {current}/{max} попытки}}

# login_emailCode_invalidCodeMessage
source: Invalid code
ru: Неверный код

# login_emailCode_noCodeMessage
source: Attempts ended. Request a new code
ru: Попытки закончились, запросите новый код

# login_emailCode_goToEmailButtonText
source: Go to e-mail app
ru: Перейти в почту

# login_emailCode_pasteCodeDialogTitle
source: Insert code
ru: Вставить код

# login_emailCode_pasteCodeDialogContent
source: Insert code
ru: Вставить код

# login_emailCode_pasteCodeDialogAffirmativeActionText
source: Yes
ru: Да

# login_emailCode_pasteCodeDialogNegativeActionText
source: No
ru: Нет

# login_emailCode_chooseEmailAppToGoDialogTitle
source: Choose app
ru: Выберите приложение

# login_emailCode_resendCodeButtonText
source: Send again
ru: Отправить повторно

# login_emailCode_failedToResendCodeMessage
source: Failed to send code
ru: Не удалось отправить код

# login_emailCode_successfullyResentCodeMessage
source: Code was successfully sent
ru: Код успешно отправлен

# login_emailCode_connectionErrorMessage
source: Connection error
ru: Ошибка подключения

# login_emailCode_undefinedErrorMessage
source: Something went wrong
ru: Что-то пошло не так

# registration_registration_pageTitle
source: Sign up
ru: Регистрация

# registration_registration_usernameInputHint
source: Username
ru: Имя пользователя

# registration_registration_emailAlreadyUsedMessage
source: Unavailable E-mail
ru: Недоступный E-mail

# registration_registration_usernameAlreadyUsedMessage
source: Unavailable username
ru: Недоступное имя пользователя

# registration_registration_birthdayYearInputHint
source: Birthday year
ru: Год рождения

# registration_registration_genderInputHint
source: Gender
ru: Пол

# registration_registration_passwordInputHint
source: Password
ru: Пароль

# registration_registration_repeatPasswordInputHint
source: Repeat password
ru: Повторите пароль

# registration_registration_usernameAllowedSymbolsDialogTitle
source: Username
ru: Имя пользователя

# registration_registration_usernameRequiredFromToSymbols
source: From {from} to {to} symbols
ru: От {from} до {to} символов

# registration_registration_usernameAllowedSymbolsDialogLowercaseLatinLettersItem
source: Lowercase latin letters a-z
ru: Строчные латинские буквы a-z

# registration_registration_usernameAllowedSymbolsDialogDigitsItem
source: Digits
ru: Цифры

# registration_registration_usernameAllowedSymbolsDialogSpecialSymbolsItem
source: Symbols ".", "_"
ru: Символы ".", "_"

# registration_registration_usernameAllowedSymbolsDialogActionText
source: OK
ru: ОК

# registration_registration_nextStepButtonText
source: Next
ru: Далее

# registration_registration_passwordRequiredSymbolsDialogTitle
source: Password
ru: Пароль

# registration_registration_passwordRequiredFromToSymbols
source: From {from} to {to} symbols
ru: От {from} до {to} символов

# registration_registration_passwordRequiredSymbolsDialogLowercaseLatinLettersItem
source: At least one lowercase latin letter a-z
ru: Минимум одна строчная латинская буква a-z

# registration_registration_passwordRequiredSymbolsDialogUppercaseLatinLettersItem
source: At least one lowercase Latin letter A-Z
ru: Минимум одна заглавная латинская буква A-Z

# registration_registration_passwordRequiredSymbolsDialogDigitsItem
source: At least one digit
ru: Минимум одна цифра

# registration_registration_submitRegistrationButtonText
source: Sign up
ru: Зарегестрироваться

# registration_registration_noRepeatedPasswordMatchMessage
source: Passwords don't match
ru: Пароли не совпадают

# registration_registration_filledIncorrectMessage
source: Fields are filled in incorrectly
ru: Поля заполнены неверно

# registration_registration_connectionErrorMessage
source: Connection error
ru: Ошибка подключения

# registration_registration_undefinedErrorMessage
source: Something went wrong
ru: Что-то пошло не так

# registration_emailCode_pageTitle
source: Just a little bit left
ru: Осталось совсем чуть-чуть

# registration_emailCode_pageSubtitle
source: Enter the code that we have sent to your e-mail
ru: Введите код, который мы отправили вам на e-mail

# registration_emailCode_attemptsLeftMessage
source: {current,plural, =1{1 attempt left} few{{current}/{max} attempts left} many{{current}/{max} attempts left} other{{current}/{max} attempts left}}
ru: {current,plural, =1{Осталась 1 попытка} few{Осталось {current}/{max} попытки} many{Осталось {current}/{max} попыток} other{Осталось {current}/{max} попытки}}

# registration_emailCode_invalidCodeMessage
source: Invalid code
ru: Неверный код

# registration_emailCode_noCodeMessage
source: Attempts ended. Request a new code
ru: Попытки закончились, запросите новый код

# registration_emailCode_goToEmailButtonText
source: Go to e-mail app
ru: Перейти в почту

# registration_emailCode_pasteCodeDialogTitle
source: Insert code
ru: Вставить код

# registration_emailCode_pasteCodeDialogContent
source: Insert code
ru: Вставить код

# registration_emailCode_pasteCodeDialogAffirmativeActionText
source: Yes
ru: Да

# registration_emailCode_pasteCodeDialogNegativeActionText
source: No
ru: Нет

# registration_emailCode_chooseEmailAppToGoDialogTitle
source: Choose app
ru: Выберите приложение

# registration_emailCode_resendCodeButtonText
source: Send again
ru: Отправить повторно

# registration_emailCode_failedToResendCodeMessage
source: Failed to send code
ru: Не удалось отправить код

# registration_emailCode_successfullyResentCodeMessage
source: Code was successfully sent
ru: Код успешно отправлен

# registration_emailCode_connectionErrorMessage
source: Connection error
ru: Ошибка подключения

# registration_emailCode_undefinedErrorMessage
source: Something went wrong
ru: Что-то пошло не так

# registration_finishRegistration_pageTitle
source: Congratulations!
ru: Поздравляем!

# registration_finishRegistration_pageSubtitle
source: You have successfully signed up
ru: Вы успешно прошли регистрацию

# registration_finishRegistration_startButtonText
source: Let's start
ru: Начинаем

# passwordRecovery_passwordRecovery_pageTitle
source: Password recovery
ru: Восстановление пароля

# passwordRecovery_passwordRecovery_emailOrUsernameInputHint
source: E-mail / username
ru: E-mail / имя пользователя

# passwordRecovery_passwordRecovery_passwordInputHint
source: New password
ru: Новый пароль

# passwordRecovery_passwordRecovery_repeatPasswordInputHint
source: Repeat password
ru: Повторите пароль

# passwordRecovery_passwordRecovery_submitRecoverButtonText
source: Recover
ru: Восстановить

# passwordRecovery_passwordRecovery_passwordRequiredSymbolsDialogTitle
source: Password
ru: Пароль

# passwordRecovery_passwordRecovery_passwordRequiredFromToSymbols
source: From {from} to {to} symbols
ru: От {from} до {to} символов

source: At least one lowercase latin letter a-z
ru: Минимум одна строчная латинская буква a-z

source: At least one lowercase Latin letter A-Z
ru: Минимум одна заглавная латинская буква A-Z

# passwordRecovery_passwordRecovery_passwordRequiredSymbolsDialogDigitsItem
source: At least one digit
ru: Минимум одна цифра

# passwordRecovery_passwordRecovery_noRepeatedPasswordMatchMessage
source: Passwords don't match
ru: Пароли не совпадают

# passwordRecovery_passwordRecovery_connectionErrorMessage
source: Connection error
ru: Ошибка подключения

# passwordRecovery_passwordRecovery_undefinedErrorMessage
source: Something went wrong
ru: Что-то пошло не так

# passwordRecovery_emailCode_pageTitle
source: Password recovery
ru: Восстановление пароля

# passwordRecovery_emailCode_pageSubtitle
source: Enter the code that we have sent to your e-mail
ru: Введите код, который мы отправили вам на e-mail

# passwordRecovery_emailCode_attemptsLeftMessage
source: {current,plural, =1{1 attempt left} few{{current}/{max} attempts left} many{{current}/{max} attempts left} other{{current}/{max} attempts left}}
ru: {current,plural, =1{Осталась 1 попытка} few{Осталось {current}/{max} попытки} many{Осталось {current}/{max} попыток} other{Осталось {current}/{max} попытки}}

# passwordRecovery_emailCode_invalidCodeMessage
source: Invalid code
ru: Неверный код

# passwordRecovery_emailCode_noCodeMessage
source: Attempts ended. Request a new code
ru: Попытки закончились, запросите новый код

# passwordRecovery_emailCode_goToEmailButtonText
source: Go to e-mail app
ru: Перейти в почту

# passwordRecovery_emailCode_pasteCodeDialogTitle
source: Insert code
ru: Вставить код

# passwordRecovery_emailCode_pasteCodeDialogContent
source: Insert code
ru: Вставить код

# passwordRecovery_emailCode_pasteCodeDialogAffirmativeActionText
source: Yes
ru: Да

# passwordRecovery_emailCode_pasteCodeDialogNegativeActionText
source: No
ru: Нет

# passwordRecovery_emailCode_chooseEmailAppToGoDialogTitle
source: Choose app
ru: Выберите приложение

# passwordRecovery_emailCode_resendCodeButtonText
source: Send again
ru: Отправить повторно

# passwordRecovery_emailCode_failedToResendCodeMessage
source: Failed to send code
ru: Не удалось отправить код

# passwordRecovery_emailCode_successfullyResentCodeMessage
source: Code was successfully sent
ru: Код успешно отправлен

# passwordRecovery_emailCode_connectionErrorMessage
source: Connection error
ru: Ошибка подключения

# passwordRecovery_emailCode_undefinedErrorMessage
source: Something went wrong
ru: Что-то пошло не так

# root_bottomNavigationBar_feedLabel
source: Feed
ru: Подписки

# root_bottomNavigationBar_searchLabel
source: Search
ru: Поиск

# root_bottomNavigationBar_homeLabel
source: Home
ru: Главная

# root_bottomNavigationBar_catalogLabel
source: Catalog
ru: Каталог

# root_bottomNavigationBar_userLabel
source: Profile
ru: Профиль

# root_home_curtainHeaderDateJanuary
source: January {day}
ru: {day} января

# root_home_curtainHeaderDateFebruary
source: February {day}
ru: {day} февраля

# root_home_curtainHeaderDateMarch
source: March {day}
ru: {day} марта

# root_home_curtainHeaderDateApril
source: April {day}
ru: {day} апреля

# root_home_curtainHeaderDateMay
source: May {day}
ru: {day} мая

# root_home_curtainHeaderDateJune
source: June {day}
ru: {day} июня

# root_home_curtainHeaderDateJuly
source: July {day}
ru: {day} июля

# root_home_curtainHeaderDateAugust
source: August {day}
ru: {day} августа

# root_home_curtainHeaderDateSeptember
source: September {day}
ru: {day} сентября

# root_home_curtainHeaderDateOctober
source: October {day}
ru: {day} октября

# root_home_curtainHeaderDateNovember
source: November {day}
ru: {day} ноября

# root_home_curtainHeaderDateDecember
source: December {day}
ru: {day} декабря

# root_home_curtainContentTitle
source: Today
ru: Сегодня

# root_home_curtainContentFeelsLikeTemperatureCelsiusText
source: Feels like {temperature}°C
ru: Ощущается как {temperature}°C

# root_home_curtainContentFeelsLikeTemperatureFahrenheitText
source: Feels like {temperature}°F
ru: Ощущается как {temperature}°F

# root_home_curtainContentPrecipitationsTitle
source: Precipitations
ru: Осадки

# root_home_curtainContentPrecipitationsValueMetricText
source: {precipitations} mm
ru: {precipitations} мм

# root_home_curtainContentPrecipitationsValueImperialText
source: {precipitations} in
ru: {precipitations} инч

# root_home_curtainContentHumidityTitle
source: Humidity
ru: Влажность

# root_home_curtainContentWindSpeedTitle
source: Wind
ru: Ветер

# root_home_curtainContentWindSpeedValueMetricText
source: {windSpeed} m/s
ru: {windSpeed} м/с

# root_home_curtainContentWindSpeedValueImperialText
source: {windSpeed} m/h
ru: {windSpeed} м/ч

# root_home_curtainContentPressureTitle
source: Pressure
ru: Давление

# root_home_curtainContentPressureValueMetricText
source: {pressure} mm Hg
ru: {pressure} мм рт ст

# root_home_curtainContentPressureValueImperialText
source: {pressure} in Hg
ru: {pressure} инч рт ст

# root_home_curtainContentWeatherForecastTitle
source: {days,plural, =1{Weather for 1 day} few{Weather for {days} days} many{Weather for {days} days} other{Weather for {days} days}}
ru: {days,plural, =1{Погода на 1 день} few{Погода на {days} дня} many{Погода на {days} дней} other{Погода на {days} дня}}

# root_home_curtainContentWeatherForecastItemDaysOfWeekAbbreviationsMonday
source: Mo
ru: Пн

# root_home_curtainContentWeatherForecastItemDaysOfWeekAbbreviationsTuesday
source: Tu
ru: Вт

# root_home_curtainContentWeatherForecastItemDaysOfWeekAbbreviationsWednesday
source: We
ru: Ср

# root_home_curtainContentWeatherForecastItemDaysOfWeekAbbreviationsThursday
source: Th
ru: Чт

# root_home_curtainContentWeatherForecastItemDaysOfWeekAbbreviationsFriday
source: Fr
ru: Пт

# root_home_curtainContentWeatherForecastItemDaysOfWeekAbbreviationsSaturday
source: Sa
ru: Сб

# root_home_curtainContentWeatherForecastItemDaysOfWeekAbbreviationsSunday
source: Su
ru: Вс

# root_home_weatherLoadingConnectionErrorMessage
source: No internet connection
ru: Отсутствует подключение к интернету

# root_home_weatherLoadingUndefinedErrorMessageTitle
source: Something went wrong
ru: Что-то пошло не так

# root_home_weatherLoadingUndefinedErrorMessageSubtitle
source: Technical error, we are solving the issue
ru: Техническая ошибка, мы решаем вопрос

# root_home_weatherLoadingTryAgainButtonText
source: Try again
ru: Повторить попытку

# root_home_choicesLoadingConnectionErrorMessage
source: No internet connection
ru: Отсутствует подключение к интернету

# root_home_choicesLoadingUndefinedErrorMessageTitle
source: Something went wrong
ru: Что-то пошло не так

# root_home_choicesLoadingUndefinedErrorMessageSubtitle
source: Technical error, we are solving the issue
ru: Техническая ошибка, мы решаем вопрос

# root_home_choicesLoadingTryAgainButtonText
source: Try again
ru: Повторить попытку

# root_user_looksCountText
source: {count, plural, =1{Look} other{Looks}}
ru: {count, plural, =0{Луков} =1{Лук} few{Лука} other{Луков}}

# root_user_followersCountText
source: {count, plural, =1{Follower} other{Followers}}
ru: {count, plural, =1{Подписчик} few{Подписчика} other{Подписчиков}}

# root_user_followsCountText
source: {count, plural, =1{Follow} other{Follows}}
ru: {count, plural, =1{Подписка} few{Подписки} other{Подписок}}

# root_followers_search_input_hint
source: Search
ru: Поиск

# root_follows_search_input_hint
source: Search
ru: Поиск

# common_lists_loadingConnectionErrorMessage
source: No internet connection
ru: Отсутствует подключение к интернету

# common_lists_loadingUndefinedErrorMessageTitle
source: Something went wrong
ru: Что-то пошло не так

# common_lists_loadingUndefinedErrorMessageSubtitle
source: Technical error, we are solving the issue
ru: Техническая ошибка, мы решаем вопрос

# common_lists_loadingTryAgainButtonText
source: Try again
ru: Повторить попытку
